Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    }

//    GPIO_PortToggle(GPIOA, 1u << 5U);
//    GPIO_PortToggle(GPIOB, 1u << 3U);
    /* Set conversionCompleted flag. This prevents an wrong conversion in main function */
    conversionCompleted = true;
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}


/*!
 * @brief main function
 */

#define DEMO_LPTMR_IRQn LPTMR0_IRQn
#define LPTMR_LED_HANDLER LPTMR0_IRQHandler
void LPTMR_LED_HANDLER(void)
//void LPTMR0_IRQHandler(void)
{
    LPTMR_ClearStatusFlags(DEMO_LPTMR_BASE, kLPTMR_TimerCompareFlag);

    // debug
    GPIO_PortToggle(GPIOB, 1u << 3U);

    GPIO_WritePinOutput(GPIOB, 3U, GPIO_HIGH);
	delay_n(10);
	GPIO_WritePinOutput(GPIOB, 3U, GPIO_LOW);

	GPIO_WritePinOutput(GPIOA, 7U, GPIO_HIGH);
	GPIO_WritePinOutput(GPIOA, 7U, GPIO_LOW);
    /*
     * Workaround for TWR-KV58: because write buffer is enabled, adding
     * memory barrier instructions to make sure clearing interrupt flag completed
     * before go out ISR
     */
    __DSB();
    __ISB();
}


lpuart_handle_t g_lpuartHandle;
uint8_t g_tipString[] = "LPUART RX ring buffer example\r\nSend back received data\r\nEcho every 8 types\r\n";
uint8_t g_rxRingBuffer[RX_RING_BUFFER_SIZE] = {0}; /* RX ring buffer. */

extern uint8_t g_rxBuffer[ECHO_BUFFER_SIZE]; /* Buffer for receive data to echo. */
extern uint8_t g_txBuffer[ECHO_BUFFER_SIZE]; /* Buffer for send data to echo. */
extern volatile bool rxBufferEmpty;
extern volatile bool txBufferFull;
extern volatile bool txOnGoing;
extern volatile bool rxOnGoing;


#define USER_PWM_NUM  2
#define WAKEUP_ENABLE 0
/*!
 * @brief main demo function.
 */


void user_showFreq(void)
{
//	PRINTF("\r\n--------------------------\r\n");
    PRINTF("kCLOCK_CoreSysClk %d.\r\n", CLOCK_GetFreq(kCLOCK_CoreSysClk));
//    PRINTF("kCLOCK_PlatClk %d.\r\n", CLOCK_GetFreq(kCLOCK_PlatClk));
//    PRINTF("kCLOCK_BusClk %d.\r\n", CLOCK_GetFreq(kCLOCK_BusClk));
//    PRINTF("kCLOCK_FlashClk %d.\r\n", CLOCK_GetFreq(kCLOCK_FlashClk));
//    PRINTF("kCLOCK_Er32kClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Er32kClk));
//    PRINTF("kCLOCK_Osc0ErClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Osc0ErClk));
//    PRINTF("kCLOCK_McgInternalRefClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgInternalRefClk));
//    PRINTF("kCLOCK_McgPeriphClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgPeriphClk));
//    PRINTF("kCLOCK_McgIrc48MClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgIrc48MClk));
//    PRINTF("kCLOCK_LpoClk %d.\r\n", CLOCK_GetFreq(kCLOCK_LpoClk));


    u32 freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
    char buf[32] = "\0";

    sprintf(buf, "%d\n", freq);


    /* Send g_tipString out. */
    lpuart_transfer_t xfer;
    xfer.data = buf;
    xfer.dataSize = strlen(buf);
    txOnGoing = true;
    LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &xfer);

    /* Wait send finished */
    while (txOnGoing)
    {
    }

}


u8 status = STATUS_WAIT_TRIG;
u8 status_rec = REC_STATUS_WAITING;


#define LED_INIT() LED_RED_INIT(LOGIC_LED_ON)
#define LED_TOGGLE() LED_RED_TOGGLE()

int main(void)
{
//    smc_power_state_t curPowerState;
//    app_power_mode_t targetPowerMode;
//    bool needSetWakeup; /* Need to set wakeup. */
//    lptmr_config_t lptmrConfig;

    /* Power related. */
//    SMC_SetPowerModeProtection(SMC, kSMC_AllowPowerModeAll);
//    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
//    {
//        PMC_ClearPeriphIOIsolationFlag(PMC);
//        NVIC_ClearPendingIRQ(LLWU_IRQn);
//    }


//    lpuart_config_t config;
//    lpuart_transfer_t xfer;
//    lpuart_transfer_t sendXfer;
//    lpuart_transfer_t receiveXfer;
//    size_t receivedBytes = 0U;
//    uint32_t i;

	LED_INIT();
    BOARD_InitPins();
    BOARD_BootClockRUN();
    CLOCK_SetLpuart0Clock(0x1U);

    GPIO_PinWrite(GPIOB, 3U, 1);
	delay_n(10);
	GPIO_PinWrite(GPIOB, 3U, 0);

	GPIO_PinWrite(GPIOA, 7U, 1);
	GPIO_PinWrite(GPIOA, 7U, 0);
	LED_TOGGLE();
	LED_TOGGLE();
	LED_TOGGLE();


    /*
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kLPUART_ParityDisabled;
     * config.stopBitCount = kLPUART_OneStopBit;
     * config.txFifoWatermark = 0;
     * config.rxFifoWatermark = 0;
     * config.enableTx = false;
     * config.enableRx = false;
     */
//    LPUART_GetDefaultConfig(&config);
//    config.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
//    config.enableTx = true;
//    config.enableRx = true;
//
//    LPUART_Init(DEMO_LPUART, &config, DEMO_LPUART_CLK_FREQ);
//    LPUART_TransferCreateHandle(DEMO_LPUART, &g_lpuartHandle, LPUART_UserCallback, NULL);
//    LPUART_TransferStartRingBuffer(DEMO_LPUART, &g_lpuartHandle, g_rxRingBuffer, RX_RING_BUFFER_SIZE);
//
//
//    NVIC_EnableIRQ(LLWU_IRQn);
//    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);



    // lptimer init
    /* Configure LPTMR */
    /*
     * lptmrConfig.timerMode = kLPTMR_TimerModeTimeCounter;
     * lptmrConfig.pinSelect = kLPTMR_PinSelectInput_0;
     * lptmrConfig.pinPolarity = kLPTMR_PinPolarityActiveHigh;
     * lptmrConfig.enableFreeRunning = false;
     * lptmrConfig.bypassPrescaler = true;
     * lptmrConfig.prescalerClockSource = kLPTMR_PrescalerClock_1;
     * lptmrConfig.value = kLPTMR_Prescale_Glitch_0;
     */
//    lptmrConfig.prescalerClockSource = kLPTMR_PrescalerClock_0;
//    LPTMR_GetDefaultConfig(&lptmrConfig);
//
//    /* Initialize the LPTMR */
//    LPTMR_Init(DEMO_LPTMR_BASE, &lptmrConfig);
//
//    /*
//     * Set timer period.
//     * Note : the parameter "ticks" of LPTMR_SetTimerPeriod should be equal or greater than 1.
//    */
//    LPTMR_SetTimerPeriod(DEMO_LPTMR_BASE, USEC_TO_COUNT(250000, 1000));
//
//    /* Enable timer interrupt */
//    LPTMR_EnableInterrupts(DEMO_LPTMR_BASE, kLPTMR_TimerInterruptEnable);
//
//    /* Enable at the NVIC */
//    EnableIRQ(DEMO_LPTMR_IRQn);
//
//    LPTMR_StartTimer(DEMO_LPTMR_BASE);


while(1);


#if 0





    {
        curPowerState = SMC_GetPowerModeState(SMC);

//        APP_ShowPowerMode(curPowerState);
//        user_showFreqList();

        // set default powermode as vlpr
        if(curPowerState != kSMC_PowerStateVlpr)
        {
			targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        }
        else
        {
        		targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        }
        // A:run, D:vlpr, I:vlls3
//        PRINTF("\r\nTarget %c \r\n", targetPowerMode);

		if ((targetPowerMode > kAPP_PowerModeMin) && (targetPowerMode < kAPP_PowerModeMax))
		{
			/* If could not set the target power mode, loop continue. */
			if (!APP_CheckPowerMode(curPowerState, targetPowerMode))
			{
//				PRINTF("\r\n curPowerState %x \r\n", curPowerState);
//				continue;
//				break;
			}

